DeqingSun/arduino_core_ch32/system/CH572/SRC/StdPeriphDriver/CH572_usbhostClass.c
            PRINT("GetCfgDescr: ");
            s = CtrlGetConfigDescr();
            if(s == ERR_SUCCESS)
            {
                for(i = 0; i < ((PUSB_CFG_DESCR)Com_Buffer)->wTotalLength; i++)
                {
                    PRINT("x%02X ", (uint16_t)(Com_Buffer[i]));
                }
                PRINT("\n");
                /* ��������������,��ȡ�˵�����/���˵��ַ/���˵��С��,���±���endp_addr��endp_size�� */
                cfg = ((PUSB_CFG_DESCR)Com_Buffer)->bConfigurationValue;
                if_cls = ((PUSB_CFG_DESCR_LONG)Com_Buffer)->itf_descr.bInterfaceClass; // �ӿ������

                if((dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_STORAGE))
                { // ��USB�洢���豸,������ȷ����U��
#ifdef FOR_ROOT_UDISK_ONLY
                    CHRV3DiskStatus = DISK_USB_ADDR;
                    return (ERR_SUCCESS);
                }
                else
                {
                    return (ERR_USB_UNSUPPORT);
                }
#else
                    s = CtrlSetUsbConfig(cfg); // ����USB�豸����
                    if(s == ERR_SUCCESS)
                    {
                        ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
                        ThisUsbDev.DeviceType = USB_DEV_CLASS_STORAGE;
                        PRINT("USB-Disk Ready\n");
                        SetUsbSpeed(1); // Ĭ��Ϊȫ��
                        return (ERR_SUCCESS);
                    }
                }
                else if((dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_PRINTER) && ((PUSB_CFG_DESCR_LONG)Com_Buffer)->itf_descr.bInterfaceSubClass == 0x01)
                {                              // �Ǵ�ӡ�����豸
                    s = CtrlSetUsbConfig(cfg); // ����USB�豸����
                    if(s == ERR_SUCCESS)
                    {
                        //	�豣��˵���Ϣ�Ա����������USB����
                        ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
                        ThisUsbDev.DeviceType = USB_DEV_CLASS_PRINTER;
                        PRINT("USB-Print Ready\n");
                        SetUsbSpeed(1); // Ĭ��Ϊȫ��
                        return (ERR_SUCCESS);
                    }
                }
                else if((dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_HID) && ((PUSB_CFG_DESCR_LONG)Com_Buffer)->itf_descr.bInterfaceSubClass <= 0x01)
                { // ��HID���豸,����/����
                    //  ���������з�����HID�ж϶˵�ĵ�ַ
                    s = AnalyzeHidIntEndp(Com_Buffer, 0); // ���������з�����HID�ж϶˵�ĵ�ַ
                    PRINT("AnalyzeHidIntEndp %02x\n", (uint16_t)s);
                    //  �����ж϶˵�ĵ�ַ,λ7����ͬ����־λ,��0
                    if_cls = ((PUSB_CFG_DESCR_LONG)Com_Buffer)->itf_descr.bInterfaceProtocol;
                    s = CtrlSetUsbConfig(cfg); // ����USB�豸����
                    if(s == ERR_SUCCESS)
                    {
                        s = CtrlGetHIDDeviceReport(dv_cls); //��ȡ����������
                        if(s == ERR_SUCCESS)
                        {
                            for(i = 0; i < 64; i++)
                            {
                                PRINT("x%02X ", (uint16_t)(Com_Buffer[i]));
                            }
                            PRINT("\n");
                        }
                        //	�豣��˵���Ϣ�Ա����������USB����
                        ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
                        if(if_cls == 1)
                        {
                            ThisUsbDev.DeviceType = DEV_TYPE_KEYBOARD;
                            //	��һ����ʼ��,�����豸����ָʾ��LED��
                            PRINT("USB-Keyboard Ready\n");
                            SetUsbSpeed(1); // Ĭ��Ϊȫ��
                            return (ERR_SUCCESS);
                        }
                        else if(if_cls == 2)
                        {
                            ThisUsbDev.DeviceType = DEV_TYPE_MOUSE;
                            //	Ϊ���Ժ��ѯ���״̬,Ӧ�÷���������,ȡ���ж϶˿ڵĵ�ַ,���ȵ���Ϣ
                            PRINT("USB-Mouse Ready\n");
                            SetUsbSpeed(1); // Ĭ��Ϊȫ��
                            return (ERR_SUCCESS);
                        }
                        s = ERR_USB_UNSUPPORT;
                    }
                }
                else if(dv_cls == USB_DEV_CLASS_HUB)
                { // ��HUB���豸,��������
                    s = CtrlGetHubDescr();
                    if(s == ERR_SUCCESS)
                    {
                        PRINT("Max Port:%02X ", (((PXUSB_HUB_DESCR)Com_Buffer)->bNbrPorts));
                        ThisUsbDev.GpHUBPortNum = ((PXUSB_HUB_DESCR)Com_Buffer)->bNbrPorts; // ����HUB�Ķ˿�����
                        if(ThisUsbDev.GpHUBPortNum > HUB_MAX_PORTS)
                        {
                            ThisUsbDev.GpHUBPortNum = HUB_MAX_PORTS; // ��Ϊ����ṹDevOnHubPortʱ��Ϊ�ٶ�ÿ��HUB������HUB_MAX_PORTS���˿�
                        }
                        s = CtrlSetUsbConfig(cfg); // ����USB�豸����
                        if(s == ERR_SUCCESS)
                        {
                            ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
                            ThisUsbDev.DeviceType = USB_DEV_CLASS_HUB;
                            //�豣��˵���Ϣ�Ա����������USB����,�����ж϶˵������HUB�¼�֪ͨ,��������ʹ�ò�ѯ״̬���ƴ������
                            //��HUB���˿��ϵ�,��ѯ���˿�״̬,��ʼ�����豸���ӵ�HUB�˿�,��ʼ���豸
                            for(i = 1; i <= ThisUsbDev.GpHUBPortNum; i++) // ��HUB���˿ڶ��ϵ�
                            {
                                DevOnHubPort[i - 1].DeviceStatus = ROOT_DEV_DISCONNECT; // ���ⲿHUB�˿����豸��״̬
                                s = HubSetPortFeature(i, HUB_PORT_POWER);
                                if(s != ERR_SUCCESS)
                                {
                                    PRINT("Ext-HUB Port_%1d# power on error\n", (uint16_t)i); // �˿��ϵ�ʧ��
                                }
                            }
                            PRINT("USB-HUB Ready\n");
                            SetUsbSpeed(1); // Ĭ��Ϊȫ��
                            return (ERR_SUCCESS);
                        }
                    }
                }
                else
                {                              // ���Խ�һ������
                    s = CtrlSetUsbConfig(cfg); // ����USB�豸����
                    if(s == ERR_SUCCESS)
                    {
                        //	�豣��˵���Ϣ�Ա����������USB����
                        ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
                        ThisUsbDev.DeviceType = DEV_TYPE_UNKNOW;
                        SetUsbSpeed(1);       // Ĭ��Ϊȫ��
                        return (ERR_SUCCESS); /* δ֪�豸��ʼ���ɹ� */
                    }
                }
#endif
            }
        }
    }

